# Task 9
# https://habr.com/ru/post/349860/#Zadachi__1


import re


text = [
    """Вечер за окном. / Еще один день прожит. / Жизнь скоротечна...""",
    """Просто текст""",
    """Как вишня расцвела! / Она с коня согнала / И князя-гордеца.""",
    """На голой ветке / Ворон сидит одиноко… / Осенний вечер!""",
    """Тихо, тихо ползи, / Улитка, по склону Фудзи, / Вверх, до самых высот!""",
    """Жизнь скоротечна… / Думает ли об этом / Маленький мальчик.""",
]


def main(text_):
    pass


if __name__ == '__main__':
    main(text)
